app/Controllers/Cart.php

INSERT INTO `cart` (`product_id`, `users_id`, `quantity`, `nama_produk`, `harga_produk`, `diskon_produk`, `kategori_produk`, `warna_produk`, `thumb_produk`, `created_at`, `updated_at`) VALUES ('13', '2', '7', 'Product 12', '25000', '0', 'headshet', 'indian red', 'product.jpg', '2023-10-13 19:24:16', '2023-10-13 19:24:16')
---
         'created_at' => Time::now('Asia/Jakarta'),
        ];
      session()->setFlashData('success', 'Produk Berhasil Dikeranjang');
      $this->CartModel->save($data);