app/Controllers/PesananController.php

          ]);
          $index++;
      }
          $this->PesananModel->insertBatch($data);
---
INSERT INTO `pesanan` (`diskon_produk`, `harga_produk`, `kategori_produk`, `nama_produk`, `product_id`, `quantity`, `thumb_produk`, `users_id`, `warna_produk`)
VALUES ('0','25000','headshet','Product 12','13','4','product.jpg','2','indian red'), ('0','25000','headshet','Product 12','14','7','product.jpg','2','indian red')

      }
        $index1++;
    }
       $this->TransactionModel->insertBatch($data1);
---
INSERT INTO `transactions` (`created_at`, `nama_transaksi`, `saldo_keluar`, `tgl_transaksi`, `updated_at`, `users_id`)
VALUES ('2023-10-13 19:17:45','Membeli 4 Produk Product 12','25000','2023-10-13 19:17:45','2023-10-13 19:17:45','2'), ('2023-10-13 19:17:45','Membeli 7 Produk Product 12','25000','2023-10-13 19:17:45','2023-10-13 19:17:45','2')

          ];
        $this->WalletModel->update($w['id'],$newSaldo);
      }
      $this->CartModel->setData($keranjang, true, 'del')
    ->onConstraint('cart_id, product_id')
    ->where('del.quantity >', 0)
    ->deleteBatch();
---
DELETE `cart` FROM `cart`
INNER JOIN (
SELECT '5' `cart_id`, '2023-10-13 19:17:41' `created_at`, '0000-00-00 00:00:00' `deleted_at`, '0' `diskon_produk`, '25000' `harga_produk`, 'headshet' `kategori_produk`, 'Product 12' `nama_produk`, '13' `product_id`, '4' `quantity`, 'product.jpg' `thumb_produk`, '2023-10-13 19:17:41' `updated_at`, '2' `users_id`, 'indian red' `warna_produk` UNION ALL
SELECT '4' `cart_id`, '2023-10-13 19:17:36' `created_at`, '0000-00-00 00:00:00' `deleted_at`, '0' `diskon_produk`, '25000' `harga_produk`, 'headshet' `kategori_produk`, 'Product 12' `nama_produk`, '14' `product_id`, '7' `quantity`, 'product.jpg' `thumb_produk`, '2023-10-13 19:17:36' `updated_at`, '2' `users_id`, 'indian red' `warna_produk`
) `del`
ON `cart`.`cart_id` = `del`.`cart_id` AND `cart`.`product_id` = `del`.`product_id` 
WHERE `del`.`quantity` >0