app/Controllers/WalletController.php

  public function addsaldo($id)
  {
    $saldo = $this->request->getVar('saldo');
    $wallet = $this->WalletModel->getWallet();
    foreach ($wallet as $w) {
      if ($w['users_id'] == $id) {
        $newSaldo = $w['saldo'] + $saldo;
        $newSaldo1 = $w['saldo_masuk'] + $saldo;
        $dataa = [
       'nama_transaksi' => 'Saldo Masuk',
       'saldo_masuk' => $saldo,
       'users_id' => $id,
       'tgl_transaksi' => Time::now(),
       'created_at' => Time::now()
      ];
    $this->TransactionModel->insert($dataa);
        $this->WalletModel->update($w['id'], ['saldo' => $newSaldo, 'saldo_masuk' => $newSaldo1]);
---
INSERT INTO `transactions` (`nama_transaksi`, `saldo_masuk`, `users_id`, `tgl_transaksi`, `created_at`, `updated_at`) VALUES ('Saldo Masuk', '8000000', '3', '2023-10-13 22:12:55', '2023-10-13 22:12:55', '2023-10-13 22:12:55')
UPDATE `wallet` SET `saldo` = 8000000, `saldo_masuk` = 8200000, `updated_at` = '2023-10-13'
WHERE `wallet`.`id` IN ('2')

       'tgl_transaksi' => Time::now(),
       'created_at' => Time::now()
      ];
    $this->TransactionModel->insert($dataa);
    $this->WalletModel->insert($data);
---
INSERT INTO `transactions` (`nama_transaksi`, `saldo_masuk`, `users_id`, `tgl_transaksi`, `created_at`, `updated_at`) VALUES ('Saldo Masuk', '2000000', '2', '2023-10-13 19:09:11', '2023-10-13 19:09:11', '2023-10-13 19:09:11')
INSERT INTO `wallet` (`saldo`, `saldo_masuk`, `users_id`, `created_at`, `updated_at`) VALUES ('2000000', '2000000', '2', '2023-10-13 19:09:11', '2023-10-13')