app/Models/CartModel.php

SELECT *
FROM `cart`
WHERE `users_id` = '2'
AND `cart`.`deleted_at` IS NULL
---
   public function getCartById($id)
    {
      return $this->where(['users_id' => $id])->find();

SELECT *
FROM `cart`
WHERE `users_id` = '2'
AND `cart`.`deleted_at` IS NULL
---
    public function getCart()
    {
      return $this->where(['users_id' => user_id()])->findAll();

SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `users_id` = '2'
AND `cart`.`deleted_at` IS NULL
---
    public function countCart()
    {
      return $this->where(['users_id' => user_id()])->countAllResults();