app/Models/ProductModel.php

    public function getProduct($search = null){
     if ($search !== null){
      return $this->like('nama_produk',$search)->paginate(10,'product');
      }
      return $this->orderBy('id', 'DESC')->paginate(10,'product');
---
SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `product`
WHERE `product`.`deleted_at` IS NULL

    public function getProductById($id){
      return $this->where(['id' => $id])->first();
---
SELECT *
FROM `product`
WHERE `id` = '14'
AND `product`.`deleted_at` IS NULL
 LIMIT 1

    public function getProductKategori($kategori)
    {
      return $this->where(['kategori_produk' => $kategori])->orderBy('id', 'DESC')->paginate(10,'product');
---
SELECT *
FROM `product`
WHERE `kategori_produk` = 'headshet'
AND `product`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `product`
WHERE `kategori_produk` = 'headshet'
AND `product`.`deleted_at` IS NULL