app/Models/TransactionModel.php

    public function getTransaksi()
    {
      return $this->where('users_id', user_id())->orWhere('tgl_transaksi', date('Y-m-d H:i:s'))->orderBy('id DESC', 'tgl_transaksi DESC')->findAll();
---
SELECT *
FROM `transactions`
WHERE `users_id` IS NULL
OR `tgl_transaksi` = '2023-11-13 22:58:00'
ORDER BY `id` DESC