app/Models/WalletModel.php

SELECT *
FROM `wallet`
WHERE `users_id` IS NULL
---
  public function getWallet()
  {
    return $this->where(['users_id' => user_id()])->findAll();